[
    {
        "id": 1,
        "name": "Learning React: Functional Web Development with React and Redux - Test",
        "description": "If you want to learn how to build efficient user interfaces with React, this is your book. Authors Alex Banks and Eve Porcello show you how to create UIs with this small JavaScript library that can deftly display data changes on large-scale, data-driven websites without page reloads. Along the way, youíll learn how to work with functional programming and the latest ECMAScript features. Developed by Facebook and used by companies including Netflix, Walmart and The New York Times for large parts of their web interfaces, React is quickly growing in use. By learning how to build React components with this hands-on guide, youíll fully understand how useful React can be in your organization.",
        "count": 8,
        "author": "Alex Banks & Eve Porcello"
    },
    {
        "id": 2,
        "name": "Hands-On Full Stack Development with Spring Boot 2.0 and React: Build modern and scalable full stack applications using the Java-based Spring Framework 5.0 and React",
        "description": "Develop efficient and modern full-stack applications using Spring Boot and React 16 Key Features Develop resourceful backends using Spring Boot and faultless frontends using React. Explore the techniques involved in creating a full-stack app by going through a methodical approach. Learn to add CRUD functionalities and use Material UI in the user interface to make it more user-friendly. Book DescriptionApart from knowing how to write frontend and backend code, a full-stack engineer has to tackle all the problems that are encountered in the application development life cycle, starting from a simple idea to UI design, the technical design, and all the way to implementing, testing, production, deployment, and monitoring. This book covers the full set of technologies that you need to know to become a full-stack web developer with Spring Boot for the backend and React for the frontend. This comprehensive guide demonstrates how to build a modern full-stack application in practice. This book will teach you how to build RESTful API endpoints and work with the data access Layer of Spring, using Hibernate as the ORM. As we move ahead, you will be introduced to the other components of Spring, such as Spring Security, which will teach you how to secure the backend. Then, we will move on to the frontend, where you will be introduced to React, a modern JavaScript library for building fast and reliable user interfaces, and its app development environment and components. You will also create a Docker container for your application. Finally, the book will lay out the best practices that underpin professional full-stack web development. What you will learn Create a RESTful web service with Spring Boot Understand how to use React for frontend programming Gain knowledge of how to create unit tests using JUnit Discover the techniques that go into securing the backend using Spring Security Learn how to use Material UI in the user interface to make it more user-friendly Create a React app by using the Create React App starter kit made by Facebook Who this book is forJava developers who are familiar with Spring, but have not yet built full-stack applications.",
        "count": 2,
        "author": "Juha Hinkula"
    },
    {
        "id": 3,
        "name": "Angular: Up and Running- Learning Angular, Step by Step",
        "description": "If you’re familiar with JavaScript, this hands-on guide will quickly get you up to speed on the Angular framework for building high-performance web-based desktop, mobile, and single-page applications. Initially dubbed Angular 2, this version is a complete rewrite from the same team that built the initial version of AngularJS. Developers familiar with that earlier version will also find this book to be a valuable resource. Author Shyam Seshadri takes you step-by-step through Angular’s core building blocks in detail. You’ll start by creating a simple Angular application before diving into Angular components, services, server calls, routing, and production requirements. By the end of the book, you’ll be ready to use Angular for your own applications.",
        "count": 4,
        "author": "Shyam Seshadri"
    },
    {
        "id": 4,
        "name": "Learning Angular for .NET Developers",
        "description": "Build efficient web apps and deliver great results by integrating Angular and the .NET framework About This Book * Become a more productive developer and learn to use frameworks that implement good development practices * Achieve advanced autocompletion, navigation, and refactoring in Angular using Typescript * Follow a gradual introduction to the concepts with a lot of examples and explore the evolution of a production-ready application Who This Book Is For If you are a .NET developer who now wants to efficiently build single-page applications using the new features that Angular 4 has to offer, then this book is for you. Familiarity of HTML, CSS, and JavaScript is assumed to get the most from this book. What You Will Learn * Create a standalone Angular application to prototype user interfaces * Validate complex forms with Angular version 4 and use Bootstrap to style them * Build RESTful web services that work well with single-page applications * Use Gulp and Bower in Visual Studio to run tasks and manage JavaScript packages * Implement automatic validation for web service requests to reduce your boilerplate code * Use web services with Angular version 4 to offload and secure your application logic * Test your Angular version 4 and web service code to improve the quality of your software deliverables In Detail Are you are looking for a better, more efficient, and more powerful way of building front-end web applications? Well, look no further, you have come to the right place! This book comprehensively integrates Angular version 4 into your tool belt, then runs you through all the new options you now have on hand for your web apps without bogging you down. The frameworks, tools, and libraries mentioned here will make your work productive and minimize the friction usually associated with building server-side web applications. Starting off with building blocks of Angular version 4, we gradually move into integrating TypeScript and ES6. You will get confident in building single page applications and using Angular for prototyping components. You will then move on to building web services and full-stack web application using ASP.NET WebAPI. Finally, you will learn the development process focused on rapid delivery and testability for all application layers. Style and approach This book covers everything there is to know about getting well-acquainted with Angular 4 and .NET without bogging you down. Everything is neatly laid out under clear headings for quick consultation, offering you the information required to understand a concept immediately, with short, relevant examples of each feature.",
        "count": 6,
        "author": "Rajesh Gunasundaram"
    },
    {
        "id": 5,
        "name": "Learning Vue.js 2",
        "description": "Learn how to build amazing and complex reactive web applications easily with Vue.js About This Book * Learn how to propagate DOM changes across the website without writing extensive jQuery callbacks code. * Learn how to achieve reactivity and easily compose views with Vue.js and understand what it does behind the scenes. * Explore the core features of Vue.js with small examples, learn how to build dynamic content into preexisting web applications, and build Vue.js applications from scratch. Who This Book Is For This book is perfect for novice web developer seeking to learn new technologies or frameworks and also for webdev gurus eager to enrich their experience. Whatever your level of expertise, this book is a great introduction to the wonderful world of reactive web apps. What You Will Learn * Build a fully functioning reactive web application in Vue.js from scratch. * The importance of the MVVM architecture and how Vue.js compares with other frameworks such as Angular.js and React.js. * How to bring reactivity to an existing static application using Vue.js. * How to use plugins to enrich your applications. * How to develop customized plugins to meet your needs. * How to use Vuex to manage global application's state. In Detail Vue.js is one of the latest new frameworks to have piqued the interest of web developers due to its reactivity, reusable components, and ease of use. This book shows developers how to leverage its features to build high-performing, reactive web interfaces with Vue.js. From the initial structuring to full deployment, this book provides step-by-step guidance to developing an interactive web interface from scratch with Vue.js. You will start by building a simple application in Vue.js which will let you observe its features in action. Delving into more complex concepts, you will learn about reactive data binding, reusable components, plugins, filters, and state management with Vuex. This book will also teach you how to bring reactivity to an existing static application using Vue.js. By the time you finish this book you will have built, tested, and deployed a complete reactive application in Vue.js from scratch. Style and approach This book is a thorough, step-by-step guide showing readers how to build complete web apps with Vue.js. While teaching its intricacies, this book shows how to implement the MVVM architecture in the real world and build high-performing web interfaces.",
        "count": 5,
        "author": "Olga Filipova"
    },
    {
        "id": 6,
        "name": "Vue.js: Up and Running",
        "description": "Get a brisk introduction to building fast, interactive single-page web applications with Vue.js, the popular JavaScript framework that organizes and simplifies web development. with this practical guide, you'll quickly move from basics to custom components and advanced features-including JSX, the JavaScript syntax extension. Author Callum Macrae shows you how to use the most useful libraries in the Vue ecosystem, such as vue-router for routing, vuex for state management and vue-test-utils for testing. If you'r a frontend developer familiar with JavaScript, HTML and CSS, this book will show you how to develop a fully featured web application using Vue. Learn Vue.js basics, including its use of templates to display data on a page. Set up Vue projects from scratch, or use vue-cli to set up from a template. Create a maintainable codebase by splitting code into self-contained components. Discover how Vue.js works with CSS to style your websites and applications. Use render functions and JSX, rather than templates, to determine what Vue displays. Control how code is executed and displayed with vue-router. Manage state in one centralized place with the Vuex library. Write unit tests to ensure your Vue components don't break in the future",
        "count": 3,
        "author": "Callum Macrae"
    }
]